[Killed] BlockStatement
src/Bank.ts:12:90
    * @param currency2 : Currency;
    * @param rate : number;
    */
-  static withExchangeRate (currency1: Currency, currency2: Currency, rate: number): Bank {
-    const bank = new Bank()
-    bank.addExchangeRate(currency1, currency2, rate)
-    return bank
-  }
+  static withExchangeRate (currency1: Currency, currency2: Currency, rate: number): Bank {}
 
   /**
killedBy: Bank convert from eur to usd returns number
statusReason: TypeError: Cannot read properties of undefined (reading 'convert')

[Killed] BlockStatement
src/Bank.ts:23:82
    * @param currency2 : Currency;
    * @param rate :  number;
    */
-  addExchangeRate (currency1: Currency, currency2: Currency, rate: number): void {
-    this._exchangeRates.set(currency1 + '->' + currency2, rate)
-  }
+  addExchangeRate (currency1: Currency, currency2: Currency, rate: number): void {}
 
   /**
killedBy: Bank convert from eur to usd returns number
statusReason: Error: EUR-> USD

[Killed] BlockStatement
src/Bank.ts:31:75
    * @param firstCurrency : Currency;
    * @param secondCurrency : Currency;
    */
-  canConvert (firstCurrency: Currency, secondCurrency: Currency): boolean {
-    return firstCurrency === secondCurrency || this._exchangeRates.has(firstCurrency + '->' + secondCurrency)
-  }
+  canConvert (firstCurrency: Currency, secondCurrency: Currency): boolean {}
 
   /**
killedBy: Bank convert from eur to usd returns number
statusReason: Error: EUR-> USD

[Killed] EqualityOperator
src/Bank.ts:32:12
    * @param secondCurrency : Currency;
    */
   canConvert (firstCurrency: Currency, secondCurrency: Currency): boolean {
-    return firstCurrency === secondCurrency || this._exchangeRates.has(firstCurrency + '->' + secondCurrency)
+    return firstCurrency !== secondCurrency || this._exchangeRates.has(firstCurrency + '->' + secondCurrency)
   }
 
killedBy: Bank convert from eur to eur returns same value
statusReason: Error: EUR-> EUR

[Killed] ConditionalExpression
src/Bank.ts:32:12
    * @param secondCurrency : Currency;
    */
   canConvert (firstCurrency: Currency, secondCurrency: Currency): boolean {
-    return firstCurrency === secondCurrency || this._exchangeRates.has(firstCurrency + '->' + secondCurrency)
+    return false || this._exchangeRates.has(firstCurrency + '->' + secondCurrency)
   }
 
killedBy: Bank convert from eur to eur returns same value
statusReason: Error: EUR-> EUR

[Killed] BlockStatement
src/Bank.ts:40:78
    * @param currency1 : Currency;
    * @param currency2 : Currency;
    */
-  convert (amount: number, currency1: Currency, currency2: Currency): number {
-    if (!this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
-
-    return currency2 === currency1
-      ? amount
-      : amount * this._exchangeRates.get(currency1 + '->' + currency2)
-  }
+  convert (amount: number, currency1: Currency, currency2: Currency): number {}
 }
 
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: undefined

[Killed] BooleanLiteral
src/Bank.ts:41:9
    * @param currency2 : Currency;
    */
   convert (amount: number, currency1: Currency, currency2: Currency): number {
-    if (!this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
+    if (this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
 
     return currency2 === currency1
killedBy: Bank convert from eur to usd returns number
statusReason: Error: EUR-> USD

[Killed] BlockStatement
src/Bank.ts:41:49
    * @param currency2 : Currency;
    */
   convert (amount: number, currency1: Currency, currency2: Currency): number {
-    if (!this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
+    if (!this.canConvert(currency1, currency2)) {}
 
     return currency2 === currency1
killedBy: Bank convert throws error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError

Received function did not throw

[Killed] ConditionalExpression
src/Bank.ts:43:12
   convert (amount: number, currency1: Currency, currency2: Currency): number {
     if (!this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
 
-    return currency2 === currency1
+    return true
       ? amount
       : amount * this._exchangeRates.get(currency1 + '->' + currency2)
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] EqualityOperator
src/Bank.ts:43:12
   convert (amount: number, currency1: Currency, currency2: Currency): number {
     if (!this.canConvert(currency1, currency2)) { throw new MissingExchangeRateError(currency1, currency2) }
 
-    return currency2 === currency1
+    return currency2 !== currency1
       ? amount
       : amount * this._exchangeRates.get(currency1 + '->' + currency2)
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 10

[Killed] ArithmeticOperator
src/Bank.ts:45:9
 
     return currency2 === currency1
       ? amount
-      : amount * this._exchangeRates.get(currency1 + '->' + currency2)
+      : amount / this._exchangeRates.get(currency1 + '->' + currency2)
   }
 }
killedBy: Bank convert from eur to usd returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 12
Received: 8.333333333333334
