[Killed] BlockStatement
src/MissingExchangeRateError.ts:4:58
 import { Currency } from './Currency'
 
 export class MissingExchangeRateError extends Error {
-  constructor (currency1: Currency, currency2: Currency) {
-    super(currency1 + '-> ' + currency2)
-  }
+  constructor (currency1: Currency, currency2: Currency) {}
 
   message: string
killedBy: Bank convert throws error in case of missing exchange rates
statusReason: Error: expect(received).toThrow(expected)

Expected constructor: MissingExchangeRateError
Received constructor: ReferenceError

Received message: "Must call super constructor in derived class before accessing 'this' or returning from derived constructor"

      53 |     } else {

[Killed] StringLiteral
src/MissingExchangeRateError.ts:5:23
 
 export class MissingExchangeRateError extends Error {
   constructor (currency1: Currency, currency2: Currency) {
-    super(currency1 + '-> ' + currency2)
+    super(currency1 + "" + currency2)
   }
 
killedBy: Bank test the separator of the error message
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "EUR-> KRW"
Received message:   "EURKRW"

      109 |         } else {
      110 |           stryCov_9fa48("14");
    > 111 |           throw new MissingExchangeRateError(currency1, currency2);
