[Killed] ArrowFunction
src/MoneyCalculator.ts:4:16
 import { Currency } from './Currency'
 
 export class MoneyCalculator {
-  static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
+  static Add = () => undefined
   static Times = (amount: number, currency: Currency, number: number): number => amount * number
   static Divide = (amount: number, currency: Currency, value: number): number => amount / value
killedBy: Money add in usd returns number
statusReason: Error: expect(received).toBeNumber()

Expected value to be a number received:
  undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:4:81
 import { Currency } from './Currency'
 
 export class MoneyCalculator {
-  static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
+  static Add = (amount: number, currency: Currency, amount2: number): number => amount - amount2
   static Times = (amount: number, currency: Currency, number: number): number => amount * number
   static Divide = (amount: number, currency: Currency, value: number): number => amount / value
killedBy: Money test to see if operation work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 15
Received: -5

[Killed] ArrowFunction
src/MoneyCalculator.ts:5:18
 
 export class MoneyCalculator {
   static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
-  static Times = (amount: number, currency: Currency, number: number): number => amount * number
+  static Times = () => undefined
   static Divide = (amount: number, currency: Currency, value: number): number => amount / value
 }
killedBy: Money multiply in eur returns positive number
statusReason: Error: expect(received).toBeGreaterThan(expected)

Matcher error: received value must be a number or bigint

Received has value: undefined

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:5:82
 
 export class MoneyCalculator {
   static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
-  static Times = (amount: number, currency: Currency, number: number): number => amount * number
+  static Times = (amount: number, currency: Currency, number: number): number => amount / number
   static Divide = (amount: number, currency: Currency, value: number): number => amount / value
 }
killedBy: Money test to see if operation work
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 20
Received: 5

[Killed] ArrowFunction
src/MoneyCalculator.ts:6:19
 export class MoneyCalculator {
   static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
   static Times = (amount: number, currency: Currency, number: number): number => amount * number
-  static Divide = (amount: number, currency: Currency, value: number): number => amount / value
+  static Divide = () => undefined
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: undefined
Received: 1000.5

[Killed] ArithmeticOperator
src/MoneyCalculator.ts:6:82
 export class MoneyCalculator {
   static Add = (amount: number, currency: Currency, amount2: number): number => amount + amount2
   static Times = (amount: number, currency: Currency, number: number): number => amount * number
-  static Divide = (amount: number, currency: Currency, value: number): number => amount / value
+  static Divide = (amount: number, currency: Currency, value: number): number => amount * value
 }
 
killedBy: Money divide in korean won returns number
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 16008
Received: 1000.5
